<script>
export default {
  data() {
    return {
      currentService: 1,
      services: [
        {
          imageUrl: 'Img/noiseisolation.jpg',
          id: 1,
          name: 'Шумоизоляция автомобиля',
          description: 'Шумоизоляция автомобиля представляет собой важную процедуру, направленную на значительное улучшение комфорта и качества времени, проводимого в салоне вашего автомобиля. В условиях современных городских шумов и трассовых дорог это становится особенно актуальным. Наши специалисты гарантируют высококачественную обработку автомобиля, начиная с тщательной подготовки поверхностей и заканчивая установкой передовых звукоизоляционных материалов, разработанных для максимального подавления шумовых волн.\n' +
              '\n' +
              'Процесс начинается с диагностики существующего уровня шума и акустических характеристик вашего автомобиля. Это позволяет нам разработать индивидуальную стратегию шумоизоляции, нацеленную на оптимальное снижение вибраций и шумов от дороги, двигателя и ветра. Мы уделяем особое внимание критическим зонам, таким как пол салона, двери, багажное отделение и колесные арки, где шум может проникать наиболее интенсивно.\n' +
              '\n' +
              'Выбор материалов играет ключевую роль в достижении желаемого результата. Мы используем только самые современные и эффективные звукоизоляционные компоненты, которые не только снижают шум, но и улучшают акустические свойства салона, что особенно важно для звуковых систем высокого качества. Это позволяет вам наслаждаться глубоким и чистым звучанием музыки, не заботясь о внешних шумах.\n' +
              '\n' +
              'Профессиональные навыки наших специалистов гарантируют не только качественную установку материалов, но и их оптимальное расположение, чтобы обеспечить максимальную эффективность шумоизоляции. Мы учитываем все тонкости и особенности вашего автомобиля, создавая индивидуальный подход к каждому проекту.\n' +
              '\n' +
              'Результатом нашей работы становится существенное снижение уровня шума в салоне вашего автомобиля, что приводит к повышению комфортности путешествий и улучшению общего впечатления от вождения. Наша услуга по шумоизоляции не только защищает от нежелательных звуков, но и создает атмосферу спокойствия и уюта в вашем автомобиле, делая каждую поездку приятным и расслабляющим опытом.\n' +
              '\n' +
              'Мы гордимся своей способностью улучшать ваше автомобильное пространство, предоставляя высококачественные решения в области шумоизоляции. Наше стремление к качеству и детальному подходу позволяет нам достигать отличных результатов, удовлетворяя даже самые взыскательные потребности наших клиентов.\n'
        },
        {
          imageUrl: 'Img/install_audio.jpg',
          id: 2,
          name: 'Установка автозвука',
          description: 'Установка автозвука — это не просто добавление музыкальной системы в автомобиль, это создание атмосферы высококачественного звука и эмоций в каждой поездке. Наша команда специалистов предлагает полный спектр услуг, начиная с консультации по выбору оборудования и заканчивая настройкой системы для достижения идеального звучания в вашем автомобиле.\n' +
              '\n' +
              'Процесс установки начинается с понимания ваших музыкальных предпочтений и акустических особенностей автомобиля. Мы помогаем выбрать оптимальные компоненты, включая усилители, колонки, сабвуферы и процессоры звука, учитывая как ваш бюджет, так и желаемый уровень звукового качества. Наш опыт и знания позволяют нам рекомендовать решения, которые идеально подходят для вашего автомобиля и предпочтений в звучании.\n' +
              '\n' +
              'Установка проводится с максимальным вниманием к деталям и качеству. Мы используем только высококачественные материалы и современные технологии, чтобы гарантировать долговечность и отличное звучание вашей аудиосистемы. Наши специалисты устанавливают компоненты с акцентом на оптимальное расположение в салоне, чтобы достичь наилучшего звукового эффекта и сбалансированного звучания.\n' +
              '\n' +
              'Кроме того, мы предоставляем индивидуальную настройку звуковой системы. Это включает в себя оптимизацию звука под акустические особенности салона, настройку электронных параметров для достижения идеального баланса и объема звучания. Мы учитываем не только аудиофильские аспекты, но и эстетические предпочтения клиентов, создавая систему, которая не только звучит потрясающе, но и выглядит стильно и соответствует общему дизайну автомобиля.\n' +
              '\n' +
              'Результатом нашей работы становится удовлетворение от высококачественного звука в каждом вашем путешествии. Установка автозвука позволяет создать персонализированную атмосферу в салоне вашего автомобиля, где каждая нота звучит четко и глубоко, а каждая мелодия приносит настоящее удовольствие. Наша цель — сделать ваше автомобильное пространство местом, где музыка становится источником радости и вдохновения, подчеркивая вашу индивидуальность и стиль.\n' +
              '\n' +
              'Мы гордимся нашими возможностями предложить клиентам высококачественные решения по установке автозвука, обеспечивая при этом профессионализм, внимание к деталям и востребованное качество обслуживания.\n'
        },
        {
          imageUrl: 'Img/signal.jpg',
          imageUrl2: 'Img/signal2.jpg',
          id: 3,
          name: 'Установка автосигнализации',
          description: 'Установка автосигнализации — это важный шаг для обеспечения безопасности вашего автомобиля и защиты его содержимого от несанкционированного доступа. Наша компания предлагает профессиональную установку современных систем безопасности, которые обеспечивают надежную защиту и спокойствие для вас и вашего автомобиля.\n' +
              '\n' +
              'Процесс установки начинается с консультации, в ходе которой наши специалисты помогают выбрать наиболее подходящую систему с учетом ваших потребностей и предпочтений. Мы предлагаем широкий выбор сигнализаций с различными функциями, включая датчики движения, удара, дистанционное управление и автозапуск, что позволяет настроить систему именно под ваши требования.\n' +
              '\n' +
              'После выбора системы наши профессиональные инсталляторы приступают к установке. Мы следим за каждым этапом процесса, начиная с тщательной прокладки проводки и заканчивая интеграцией компонентов в структуру автомобиля. Мы уделяем особое внимание безопасности и эстетике установки, чтобы система не только эффективно выполняла свои функции, но и гармонично вписывалась в общий интерьер автомобиля.\n' +
              '\n' +
              'Настройка играет важную роль в успешной установке автосигнализации. Мы проводим детальную настройку всех параметров системы, чтобы обеспечить ее оптимальную работу в различных условиях. Это включает программирование дистанционного управления, проверку чувствительности датчиков и настройку реакции системы на различные ситуации.\n' +
              '\n' +
              'Результатом нашей работы становится полное спокойствие ваших автомобильных собственностей. Установка современной автосигнализации не только предотвращает попытки угона, но и улучшает общую безопасность автомобиля, обеспечивая вам комфорт и уверенность в любых ситуациях. Наша цель — предложить клиентам надежные и инновационные решения в области автобезопасности, которые делают вождение более безопасным и удобным.\n' +
              '\n' +
              'Мы гарантируем высокое качество выполнения всех работ по установке автосигнализации, а также профессиональное обслуживание и поддержку после установки. Наши специалисты всегда готовы ответить на ваши вопросы и помочь выбрать оптимальное решение для вашего автомобиля.'
        },
        {
          imageUrl: 'Img/Podium.jpeg',
          id: 4,
          name: 'Изготовление подиумов',
          description: 'Изготовление подиумов для автомобиля — это процесс создания специальных платформ или стоек, которые предназначены для установки дополнительного оборудования или улучшения внешнего вида салона. Эта услуга позволяет автолюбителям индивидуализировать и функционализировать внутреннее пространство автомобиля, делая его более удобным и эстетически привлекательным.\n' +
              '\n' +
              'Процесс изготовления начинается с консультации с клиентом, где определяются функциональные и дизайнерские требования к подиумам. Мы обсуждаем цели и ожидания, чтобы предложить наилучшие решения для оптимального использования пространства в салоне автомобиля. Подиумы могут быть разработаны под конкретные компоненты, такие как аудиосистемы, экраны, освещение или декоративные элементы, что позволяет создать уникальный и функциональный интерьер.\n' +
              '\n' +
              'Выбор материалов играет важную роль в процессе изготовления. Мы используем высококачественные и долговечные материалы, которые соответствуют стилистическим и функциональным требованиям клиента. Это может включать различные виды дерева, пластика, металла или комбинации материалов, которые подчеркивают индивидуальный стиль и характер автомобиля.\n' +
              '\n' +
              'Техническая часть включает в себя создание точных чертежей и проектирование подиумов с учетом всех технических аспектов. Мы стремимся к безупречному качеству изготовления, учитывая каждую деталь и обеспечивая идеальную посадку компонентов на подиумах. Наши специалисты работают с современным оборудованием и инструментами, чтобы гарантировать высокоточность и надежность каждого изготовленного изделия.\n' +
              '\n' +
              'Установка подиумов производится с акцентом на безопасность и эргономику. Мы учитываем все особенности салона автомобиля, чтобы обеспечить легкость установки и интеграции подиумов в общую композицию интерьера. Это позволяет создать гармоничный образ и обеспечить удобство использования добавленных элементов.\n' +
              '\n' +
              'Результатом нашей работы становится не только улучшение функциональности автомобиля, но и повышение его эстетических качеств. Изготовление подиумов предоставляет уникальную возможность персонализировать внутренний дизайн автомобиля, делая его более удобным, стильным и приспособленным под индивидуальные потребности владельца.\n' +
              '\n' +
              'Мы гарантируем высокое качество всех наших изделий и услуг по изготовлению подиумов, обеспечивая профессионализм и внимание к деталям на всех этапах сотрудничества с клиентами.\n'
        },
        {
          imageUrl: 'Img/doorcart.jpg',
          id: 5,
          name: 'Изготовление дверных карт',
          description: 'Изготовление дверных карт — это процесс создания и установки индивидуальных панелей для дверей автомобиля, которые не только улучшают эстетический вид салона, но и добавляют функциональности. Наши дверные карты сочетают в себе высокое качество материалов, инновационные технологии и дизайнерские решения, чтобы предоставить вашему автомобилю уникальный и стильный облик.\n' +
              '\n' +
              'Процесс начинается с детальной консультации с клиентом, чтобы понять его предпочтения и требования. Мы обсуждаем дизайн, выбор материалов, цветовую гамму и функциональные особенности, которые должны быть включены в новые дверные карты. Это может включать дополнительные карманы для хранения, подстаканники, улучшенные подлокотники или встроенные элементы освещения и управления.\n' +
              '\n' +
              'Выбор материалов является важной частью процесса. Мы предлагаем широкий ассортимент материалов, таких как высококачественная кожа, алькантара, различные виды пластика и металла. Все материалы подбираются с учетом долговечности, эстетики и соответствия общему стилю интерьера автомобиля. Мы также уделяем внимание экологическим аспектам, предлагая эко-дружественные варианты материалов.\n' +
              '\n' +
              'На этапе проектирования наши специалисты создают детальные чертежи и макеты, учитывая все особенности и размеры вашего автомобиля. Мы разрабатываем дизайн, который гармонично вписывается в существующий интерьер, добавляя функциональности и улучшая общую эстетическую привлекательность. Процесс включает 3D-моделирование и тестирование прототипов, чтобы убедиться в идеальной посадке и функциональности дверных карт.\n' +
              '\n' +
              'Изготовление дверных карт осуществляется с использованием современного оборудования и передовых технологий. Наши мастера тщательно обрабатывают каждый элемент, обеспечивая высокое качество и точность исполнения. Мы следим за каждой деталью, от пошива кожи до установки декоративных элементов, чтобы создать продукт, который отвечает самым высоким стандартам.\n' +
              '\n' +
              'Установка дверных карт производится профессиональными инсталляторами, которые гарантируют точную и надежную интеграцию в ваш автомобиль. Мы уделяем особое внимание всем техническим аспектам, чтобы новые панели не только выглядели великолепно, но и функционировали безупречно. Это включает проверку и настройку всех встроенных элементов, таких как динамики, кнопки управления и подсветка.\n' +
              '\n' +
              'Результатом нашей работы становится преобразование вашего автомобиля с учетом всех ваших пожеланий. Новые дверные карты не только улучшают внешний вид и функциональность салона, но и придают вашему автомобилю уникальность и стиль. Это идеальное решение для тех, кто хочет выделить свой автомобиль и сделать его по-настоящему особенным.\n' +
              '\n' +
              'Мы гарантируем высокое качество всех наших изделий и услуг по изготовлению дверных карт, обеспечивая профессионализм и внимание к деталям на всех этапах сотрудничества с клиентами. Наши специалисты всегда готовы предложить индивидуальные решения и помочь создать интерьер, который будет радовать вас каждый день.'
        },
        {
          imageUrl: 'Img/sub1.jpg',
          imageUrl2: 'Img/sub.jpg',
          id: 6,
          name: 'Изготовление стелс-коробов',
          description: 'Изготовление стелс-коробов для автомобилей — это процесс создания специальных скрытых коробов для сабвуферов и других аудиокомпонентов, которые идеально вписываются в интерьер автомобиля, не занимая лишнего пространства. Эта услуга позволяет сохранить функциональность и стиль салона, обеспечивая при этом мощное и качественное звучание аудиосистемы.\n' +
              '\n' +
              'Процесс начинается с детальной консультации с клиентом, чтобы понять его требования и предпочтения. Мы обсуждаем цели, которые должны быть достигнуты, особенности автомобиля и предпочтения в дизайне. На основе этой информации наши специалисты разрабатывают индивидуальный проект стелс-короба, который идеально впишется в ваш автомобиль. Мы используем только высококачественные материалы для изготовления стелс-коробов. Это может включать дерево, стеклопластик, специальные акустические материалы и обивку, соответствующую интерьеру вашего автомобиля. Выбор материалов зависит от конструкции и местоположения короба, а также от желаемого звукового результата.\n' +
              '\n' +
              'На этапе проектирования наши специалисты создают детальные 3D-модели будущих стелс-коробов, учитывая все технические аспекты и особенности вашего автомобиля. Это позволяет визуализировать конечный продукт и внести необходимые корректировки до начала производства. При необходимости создаются прототипы для тестирования и подтверждения идеальной посадки и функциональности. Изготовление стелс-коробов проводится с использованием современного оборудования и передовых технологий. Наши мастера тщательно работают над каждым элементом, обеспечивая точность и высокое качество исполнения. Мы уделяем внимание всем деталям, от формирования основной структуры до нанесения финальной отделки, чтобы короб не только хорошо выглядел, но и обеспечивал отличное звучание.\n' +
              '\n' +
              'Установка стелс-коробов осуществляется профессиональными инсталляторами, которые гарантируют точную и надежную интеграцию в ваш автомобиль. Мы следим за тем, чтобы короб был установлен безопасно и эстетично, не нарушая функциональность салона. В процессе установки также производится настройка аудиосистемы для достижения оптимального звукового эффекта. Результатом нашей работы является высококачественный стелс-короб, который идеально вписывается в интерьер вашего автомобиля, не занимая лишнего места и не нарушая его эстетики. Вы сможете наслаждаться мощным и качественным звуком без компромиссов по пространству и внешнему виду салона. Стелс-короба позволяют создать чистое и глубокое звучание, улучшая общую акустическую среду внутри автомобиля.\n' +
              '\n' +
              'Преимущества этой услуги заключаются в эстетике — стелс-короба скрыты и незаметны, сохраняя оригинальный вид салона, в функциональности — они не занимают лишнего пространства, оставляя полезное место для других нужд, и в качестве звука — они обеспечивают отличное звучание за счет правильной конструкции и материала. Все стелс-короба изготавливаются по индивидуальному проекту, учитывая все особенности вашего автомобиля. Мы гарантируем высокое качество всех наших изделий и услуг по изготовлению стелс-коробов, обеспечивая профессионализм и внимание к деталям на всех этапах сотрудничества с клиентами. Наша цель — сделать ваше автомобильное пространство уникальным и функциональным, при этом обеспечив высочайшее качество звука.\n'
        }
      ]
    }
  },
  methods: {
    selectService(service) {
      this.currentService = service;
    }
  },
  mounted() {
    this.currentService = this.services[0];
  }
}
</script>

<template>
  <div class="container mt-5">
    <h1 class="mb-5">Наши услуги</h1>
    <div class="d-flex align-items-start">
      <div class="col-md-3 nav flex-column nav-pills me-3 mt-2" id="v-pills-tab" role="tablist" aria-orientation="vertical">
<!--        <button class="nav-link btn btn-dark active" id="v-pills-home-tab" data-bs-toggle="pill" data-bs-target="#v-pills-home" type="button" role="tab" aria-controls="v-pills-home" aria-selected="true">Home</button>-->
<!--        <button class="nav-link" id="v-pills-profile-tab" data-bs-toggle="pill" data-bs-target="#v-pills-profile" type="button" role="tab" aria-controls="v-pills-profile" aria-selected="false">Profile</button>-->
<!--        <button class="nav-link" id="v-pills-disabled-tab" data-bs-toggle="pill" data-bs-target="#v-pills-disabled" type="button" role="tab" aria-controls="v-pills-disabled" aria-selected="false" disabled>Disabled</button>-->
<!--        <button class="nav-link" id="v-pills-messages-tab" data-bs-toggle="pill" data-bs-target="#v-pills-messages" type="button" role="tab" aria-controls="v-pills-messages" aria-selected="false">Messages</button>-->
<!--        <button class="nav-link" id="v-pills-settings-tab" data-bs-toggle="pill" data-bs-target="#v-pills-settings" type="button" role="tab" aria-controls="v-pills-settings" aria-selected="false">Settings</button>-->
        <button
            v-for="service in services"
            :key="service.id"
            type="button"
            class="btn btn-dark"
            data-bs-toggle="pill"
            :class="{ 'active' : currentService && currentService.id === service.id }"
            @click="selectService(service)"
        >
          {{ service.name }}
        </button>
      </div>
      <div class="col-md-9 tab-content" id="v-pills-tabContent">
        <div class="tab-pane fade show active" id="{{ services.id }}" role="tabpanel" aria-labelledby="{{ services.id }}" tabindex="0">
          <h3 class="mb-1">{{ currentService.name }}</h3>
          <img :src="currentService.imageUrl"
               alt=""
               class=" my-3 rounded-5 img-fluid"
               />
          <span class="font-monospace fs-6 mb-1" style="white-space: pre-line;">{{ currentService.description }}</span>
        </div>
<!--        <div class="tab-pane fade" id="v-pills-profile" role="tabpanel" aria-labelledby="v-pills-profile-tab" tabindex="0">...</div>-->
<!--        <div class="tab-pane fade" id="v-pills-disabled" role="tabpanel" aria-labelledby="v-pills-disabled-tab" tabindex="0">...</div>-->
<!--        <div class="tab-pane fade" id="v-pills-messages" role="tabpanel" aria-labelledby="v-pills-messages-tab" tabindex="0">...</div>-->
<!--        <div class="tab-pane fade" id="v-pills-settings" role="tabpanel" aria-labelledby="v-pills-settings-tab" tabindex="0">...</div>-->
      </div>
    </div>

    <!--    <div class="row">-->
<!--      <div class="col-md-3">-->
<!--        <div class="list-group">-->
<!--&lt;!&ndash;          <button type="button" class="list-group-item list-group-item-action list-group-item-dark active" aria-current="true">&ndash;&gt;-->
<!--&lt;!&ndash;            The current button&ndash;&gt;-->
<!--&lt;!&ndash;          </button>&ndash;&gt;-->
<!--&lt;!&ndash;          <button type="button" class="list-group-item list-group-item-action" data-bs-target="# {{ services.id }}" aria-expanded="false" aria-controls=" {{ services.id }}">A second button item</button>&ndash;&gt;-->
<!--&lt;!&ndash;          <button type="button" class="list-group-item list-group-item-action" data-bs-target="# {{ services.id }}" aria-expanded="false" aria-controls=" {{ services.id }}">A third button item</button>&ndash;&gt;-->
<!--&lt;!&ndash;          <button type="button" class="list-group-item list-group-item-action">A fourth button item</button>&ndash;&gt;-->
<!--&lt;!&ndash;          <button type="button" class="list-group-item list-group-item-action">A disabled button item</button>&ndash;&gt;-->
<!--          <button-->
<!--              v-for="service in services"-->
<!--              :key="service.id"-->
<!--              type="button"-->
<!--              class="list-group-item list-group-item-action"-->
<!--              :class="{ 'list-group-item-dark active' : currentService && currentService.id === service.id }"-->
<!--              @click="selectService(service)"-->
<!--          >-->
<!--            {{ service.name }}-->
<!--          </button>-->
<!--        </div>-->
<!--      </div>-->
<!--      <div class="col-md-9">-->
<!--        <div class="d-flex align-items-center fade show">-->
<!--          <img :src="currentService.image" alt="Картинка" class="img-thumbnail me-3" style="width: 100px; height: 100px;">-->
<!--          <div>-->
<!--            <h5 class="mb-1">{{ currentService.name }}</h5>-->
<!--            <p class="mb-1">{{ currentService.description }}</p>-->
<!--          </div>-->
<!--        </div>-->
<!--      </div>-->
<!--    </div>-->
  </div>
</template>

<style scoped>
.container {
  min-height: 55vh;
}

img {
  width: 100%;
}
</style>